{
  "hadiths": [
    {
      "hadithnumber": 1,
      "arabicnumber": 1,
      "text": "Сообщается от Амируль-муминин, Абу Хафс ‘Умара ибн аль-Хаттаба (да будет доволен им Аллах), что он сказал: Я слышал, как Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Поистине, дела оцениваются по намерениям, и каждому человеку воздастся согласно его намерению. Тот, чья хиджра (переселение) была к Аллаху и Его Посланнику, его хиджра будет к Аллаху и Его Посланнику. А кто совершил хиджру ради земных благ или чтобы жениться на женщине, хиджра того будет к тому, ради чего он её совершил». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 2,
      "arabicnumber": 2,
      "text": "Однажды мы сидели у Посланника Аллаха (мир ему и благословение Аллаха), и вдруг появился человек с очень белыми одеждами и очень чёрными волосами. На нём не было видно следов путешествия, и никто из нас его не знал. Он сел напротив Пророка, опёр колени на его колени и положил руки на его бёдра. И он сказал: «О, Мухаммад, расскажи мне об исламе». Пророк (мир ему) ответил: «Ислам — это засвидетельствовать, что нет божества, кроме Аллаха, и что Мухаммад — Посланник Аллаха; совершать молитву, выплачивать закят, поститься в Рамадан и совершить хадж к Дому, если есть возможность». Тогда тот человек сказал: «Ты прав». Мы удивились, как он задаёт вопрос и сам же подтверждает. Потом он спросил: «А что такое иман (вера)?» Пророк ответил: «Это вера в Аллаха, Его ангелов, Его Писания, Его посланников, в Судный день и в предопределение — как хорошее, так и плохое». Он сказал: «Ты прав». Затем спросил: «А что такое ихсан (благонравие)?» Пророк ответил: «Это поклоняться Аллаху так, как будто ты видишь Его, и даже если ты Его не видишь — поистине, Он видит тебя». Он снова сказал: «Ты прав». Потом он ушёл, и Пророк сказал: «Это был Джибриль (ангел), он пришёл, чтобы научить вас вашей религии». [Муслим]"
    },
    {
      "hadithnumber": 3,
      "arabicnumber": 3,
      "text": "Передаёт ‘Абдулла ибн ‘Умар (да будет доволен им Аллах), что Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Ислам основан на пяти [столпах]: свидетельстве, что нет божества, кроме Аллаха, и что Мухаммад — Его Посланник; совершении молитвы; выплате закята; посте в месяц Рамадан; и паломничестве к Дому (Каабе) для тех, кто способен это сделать». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 4,
      "arabicnumber": 4,
      "text": "Сообщается, что Абдулла ибн Мас‘уд (да будет доволен им Аллах) сказал: Посланник Аллаха (мир ему и благословение Аллаха), правдивый и заслуживающий доверия, сказал: «Каждый из вас создаётся в утробе своей матери в течение сорока дней как капля, затем становится сгустком крови ещё на сорок дней, потом становится кусочком плоти на сорок дней. Затем к нему отправляется ангел, который вдувает в него душу и записывает четыре вещи: его удел, срок жизни, дела и будет ли он счастливым или несчастным. Клянусь Аллахом, кроме Которого нет иного божества, кто-либо из вас может совершать дела обитателей Рая до тех пор, пока между ним и Раем не останется лишь локоть, но затем предопределение опережает, и он совершает дела обитателей Ада и входит в Ад. И наоборот, кто-либо может совершать дела обитателей Ада до тех пор, пока не останется лишь локоть, но затем предопределение опережает, и он совершает дела обитателей Рая и входит в Рай». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 5,
      "arabicnumber": 5,
      "text": "Передаёт Аиша (да будет доволен ею Аллах): Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Кто введёт в наше дело (ислам), то, чего в нём нет, то это будет отвергнуто». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 6,
      "arabicnumber": 6,
      "text": "Передаёт ан-Нуман ибн Башир (да будет доволен им Аллах): Я слышал, как Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Поистине, дозволенное ясно, и запретное ясно, а между ними есть сомнительные вещи, о которых многие люди не знают. Тот, кто избегает сомнительного, очищает свою религию и честь. А кто впадает в сомнительное, тот впадает в запретное — как пастух, пасущий у границы, вот-вот зайдёт в запретное. Поистине, в теле есть кусочек плоти — если он будет хорошим, то всё тело будет хорошим, а если испортится — всё тело испортится. И это сердце». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 7,
      "arabicnumber": 7,
      "text": "Передаёт Тамим ад-Дари (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Религия — это искренность (насихах)». Мы сказали: «Кому, о Посланник Аллаха?» Он сказал: «Аллаху, Его Книге, Его Посланнику, правителям мусульман и всем мусульманам». [Муслим]"
    },
    {
      "hadithnumber": 8,
      "arabicnumber": 8,
      "text": "Передаёт Абдулла ибн Умар (да будет доволен им Аллах): Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Мне было велено сражаться с людьми, пока они не засвидетельствуют, что нет божества, кроме Аллаха, и что Мухаммад — Посланник Аллаха, не установят молитву и не выплатят закят. Если они сделают это, то их кровь и имущество будут защищены от меня, кроме как по праву ислама. А расчёт их — перед Аллахом». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 9,
      "arabicnumber": 9,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Избегайте того, что я запретил, и выполняйте из того, что я повелел, сколько сможете. Поистине, те, кто пришли до вас, погибли из-за чрезмерных вопросов и разногласий со своими пророками». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 10,
      "arabicnumber": 10,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Поистине, Аллах — благой и не принимает ничего, кроме благого. Аллах повелел верующим то же, что Он повелел посланникам». Затем он упомянул человека, совершающего длительное путешествие, лохматого и покрытого пылью, который поднимает руки к небу и говорит: «О, Господь! О, Господь!», тогда как его еда — запретна, питьё — запретно, одежда — запретна и он напитан запретным. Как же может быть отвечено на такую мольбу?» [Муслим]"
    },
    {
      "hadithnumber": 11,
      "arabicnumber": 11,
      "text": "Передаёт Абу Мухаммад аль-Хасан ибн ‘Али ибн Абу Талиб (да будет доволен ими Аллах): Я запомнил от Посланника Аллаха (мир ему и благословение Аллаха): «Оставь то, что вызывает у тебя сомнение, ради того, что сомнения не вызывает. Поистине, правдивость — это спокойствие, а ложь — это сомнение». [Тирмизи, Насаи]"
    },
    {
      "hadithnumber": 12,
      "arabicnumber": 12,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Часть совершенства ислама человека — это оставление того, что его не касается». [Тирмизи]"
    },
    {
      "hadithnumber": 13,
      "arabicnumber": 13,
      "text": "Передаёт Анас (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Ни один из вас не уверует по-настоящему, пока не будет желать своему брату того же, чего желает себе». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 14,
      "arabicnumber": 14,
      "text": "Передаёт Ибн Мас‘уд (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Запрещено проливать кровь мусульманина, кроме как по одной из трёх причин: за прелюбодеяние после женитьбы, за убийство (возмездие) и за оставление религии — отход от джамаата». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 15,
      "arabicnumber": 15,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Кто верует в Аллаха и в Последний день — пусть говорит благое или молчит. Кто верует в Аллаха и в Последний день — пусть проявляет щедрость к своему соседу. Кто верует в Аллаха и в Последний день — пусть проявляет щедрость к своему гостю». [Бухари и Муслим]"
    },
    {
      "hadithnumber": 16,
      "arabicnumber": 16,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Один человек сказал Пророку (мир ему и благословение Аллаха): «Посоветуй мне». Он ответил: «Не гневайся». И он повторил просьбу несколько раз, но Пророк каждый раз говорил: «Не гневайся». [Бухари]"
    },
    {
      "hadithnumber": 17,
      "arabicnumber": 17,
      "text": "Передаёт Абу Яла Шаддад ибн Аус (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Поистине, Аллах предписал делать всё должным образом. Если вы убиваете — убивайте должным образом, если режете (животное) — делайте это должным образом. Пусть каждый из вас заострит нож и облегчит страдания животного». [Муслим]"
    },
    {
      "hadithnumber": 18,
      "arabicnumber": 18,
      "text": "Передаёт Абу Зарр аль-Гифари (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) передал от Аллаха: «О Мои рабы! Я запретил притеснение для Себя и сделал его запретным между вами, так не притесняйте друг друга…» — и дальше хадис продолжается как длинное обращение Аллаха к Своим рабам. [Муслим]"
    },
    {
      "hadithnumber": 19,
      "arabicnumber": 19,
      "text": "Передаёт Абдулла ибн Аббас (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Береги Аллаха — и Он будет оберегать тебя. Береги Аллаха — и ты найдёшь Его перед собой. Если просишь — проси у Аллаха, если ищешь помощи — ищи у Аллаха…» — и далее продолжение. [Тирмизи]"
    },
    {
      "hadithnumber": 20,
      "arabicnumber": 20,
      "text": "Передаёт Абу Мас‘уд аль-Ансари (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Поистине, из слов, дошедших до людей от первых пророков, это: если ты не стыдишься, делай, что хочешь». [Бухари]"
    },
    {
      "hadithnumber": 21,
      "arabicnumber": 21,
      "text": "Передаёт Абу ‘Амра Суфьян ибн ‘Абдулла (да будет доволен им Аллах): Я сказал: «О, Посланник Аллаха, скажи мне о исламе нечто такое, чтобы я больше ни у кого не спрашивал». Он сказал: «Скажи: 'Я уверовал в Аллаха' — и придерживайся этого». [Муслим]"
    },
    {
      "hadithnumber": 22,
      "arabicnumber": 22,
      "text": "Передаёт Джабир ибн Абдулла (да будет доволен им Аллах): Один человек спросил Пророка (мир ему): «Если я буду совершать обязательные молитвы, держать пост Рамадана, считать дозволенным дозволенное и запретным запретное, не добавляя ничего сверх того, войду ли я в Рай?» Пророк ответил: «Да». [Муслим]"
    },
    {
      "hadithnumber": 23,
      "arabicnumber": 23,
      "text": "Передаёт Абу Малик аль-Аш‘ари (да будет доволен им Аллах): Пророк (мир ему и благословение Аллаха) сказал: «Чистота — половина веры. 'Альхамду лиллях' наполняет весы, и 'Субхана-Ллах' и 'Альхамду лиллях' наполняют то, что между небом и землёй. Молитва — свет, милостыня — доказательство, терпение — сияние, а Коран — аргумент за тебя или против тебя. Каждый человек выходит утром и продаёт себя: либо освобождая её (душу), либо погубляя». [Муслим]"
    },
    {
      "hadithnumber": 24,
      "arabicnumber": 24,
      "text": "Передаёт Абу Зарр (да будет доволен им Аллах), что Пророк (мир ему) передал от Аллаха: «О рабы Мои! Я запретил несправедливость для Себя и сделал её запретной между вами — не угнетайте друг друга…» (Хадис очень длинный, в нём говорится о том, что все мы нуждаемся в Аллахе, что Он даёт, если просят, и прощает, если к Нему обращаются). [Муслим]"
    },
    {
      "hadithnumber": 25,
      "arabicnumber": 25,
      "text": "Передаёт Абу Зарр (да будет доволен им Аллах): Пророк (мир ему) сказал: «Один из вас не должен презирать доброе дело, даже если это — встретить брата с приветливым лицом». [Муслим]"
    },
    {
      "hadithnumber": 26,
      "arabicnumber": 26,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Пророк (мир ему) сказал: «Каждый день, когда люди просыпаются, на каждую их кость приходится садака: сказать доброе слово — садака, помочь кому-либо — садака… и два ракаата в духа — этого достаточно». [Бухари, Муслим]"
    },
    {
      "hadithnumber": 27,
      "arabicnumber": 27,
      "text": "Передаёт ан-Навас ибн Сам‘ан (да будет доволен им Аллах): Пророка спросили о благочестии и грехе. Он сказал: «Благочестие — это хорошее поведение, а грех — то, что вызывает сомнение в душе и ты не хочешь, чтобы об этом узнали люди». [Муслим]"
    },
    {
      "hadithnumber": 28,
      "arabicnumber": 28,
      "text": "Передаёт Вабиса ибн Ма‘бад (да будет доволен им Аллах): Я пришёл к Пророку, и он сказал: «Ты пришёл спросить о благочестии?» Я сказал: «Да». Он сказал: «Спроси своё сердце. Благочестие — это то, от чего душа спокойна, а грех — то, что тревожит сердце, даже если люди дадут тебе фетву». [Ахмад, Дарими]"
    },
    {
      "hadithnumber": 29,
      "arabicnumber": 29,
      "text": "Передаёт Му‘ад ибн Джабаль (да будет доволен им Аллах): Я спросил Пророка: «Сообщи мне дело, которое приведёт в Рай и отдалит от Ада». Он сказал: «Ты поклоняешься Аллаху, не придавая Ему сотоварищей, совершаешь молитву, выплачиваешь закят, держишь пост в Рамадан и совершаешь хадж…» — и затем он указал на врата добра: пост — щит, милостыня тушит грех, как вода тушит огонь, и ночная молитва… Потом он сказал: «Не укажу ли тебе основу всего этого?» И указал на язык: «Сдерживай это». [Тирмизи]"
    },
    {
      "hadithnumber": 30,
      "arabicnumber": 30,
      "text": "Передаёт Абу Са‘ид аль-Худри (да будет доволен им Аллах): Пророк (мир ему) сказал: «Когда кто-либо из вас видит зло — пусть изменит его рукой, если не может — языком, если не может — сердцем, и это — самая слабая вера». [Муслим]"
    },
    {
      "hadithnumber": 31,
      "arabicnumber": 31,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Пророк (мир ему) сказал: «Поистине, этот мир — тюрьма для верующего и рай для неверующего». [Муслим]"
    },
    {
      "hadithnumber": 32,
      "arabicnumber": 32,
      "text": "Передаёт Абу Са‘ид аль-Худри (да будет доволен им Аллах): Пророк (мир ему) сказал: «Не причиняй вреда и не отвечай злом на зло». [Ибн Маджа, Даркутни]"
    },
    {
      "hadithnumber": 33,
      "arabicnumber": 33,
      "text": "Передаёт Ибн ‘Аббас (да будет доволен им Аллах): Пророк (мир ему) сказал: «Если бы люди получали всё, чего они требуют, то некоторые требовали бы чужую кровь и имущество. Но довод должен быть у истца, а присяга — на том, кто отрицает». [Байхаки]"
    },
    {
      "hadithnumber": 34,
      "arabicnumber": 34,
      "text": "Передаёт Абу Са‘ид аль-Худри (да будет доволен им Аллах): Пророк (мир ему) сказал: «Кто из вас увидит зло — пусть устранит его рукой, если не может — языком, если не может — сердцем. И это — самая слабая степень веры». [Муслим]"
    },
    {
      "hadithnumber": 35,
      "arabicnumber": 35,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Пророк (мир ему) сказал: «Не завидуйте, не повышайте цену друг другу, не ненавидьте друг друга, не отворачивайтесь, не перебивайте продажи друг друга, и будьте братьями, как повелел вам Аллах». [Муслим]"
    },
    {
      "hadithnumber": 36,
      "arabicnumber": 36,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Пророк (мир ему) сказал: «Кто снимает с верующего беду в этом мире — Аллах снимет с него беду в День Суда. Кто облегчает положение нуждающегося — Аллах облегчит ему в этом мире и в Вечности…». [Муслим]"
    },
    {
      "hadithnumber": 37,
      "arabicnumber": 37,
      "text": "Передаёт Ибн ‘Аббас (да будет доволен им Аллах): Пророк (мир ему) сказал: «Завет Аллаха — в том, чтобы вы оберегали Его границы, и тогда Он будет хранить вас. Если вы просите — просите у Аллаха, если ищете помощи — ищите её у Аллаха». [Тирмизи]"
    },
    {
      "hadithnumber": 38,
      "arabicnumber": 38,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Пророк (мир ему) сказал: «Поистине, Аллах сказал: “Я буду вести войну против того, кто враждует с Моим любимым (авлия) рабом…”» (Хадис кудси, о любви Аллаха к тем, кто приближается к Нему через обязательные и дополнительные дела). [Бухари]"
    },
    {
      "hadithnumber": 39,
      "arabicnumber": 39,
      "text": "Передаёт Ибн ‘Аббас (да будет доволен им Аллах): Пророк (мир ему) сказал: «Поистине, Аллах простил моей умме ошибки, забывчивость и то, к чему они были принуждены». [Ибн Маджа, Байхаки]"
    },
    {
      "hadithnumber": 40,
      "arabicnumber": 40,
      "text": "Передаёт Абу Хурайра (да будет доволен им Аллах): Пророк (мир ему) сказал: «Будь в этом мире как чужестранец или путник». [Бухари]"
    },
    {
      "hadithnumber": 41,
      "arabicnumber": 41,
      "text": "Передаёт Ибн ‘Умар (да будет доволен им Аллах): Он говорил: «Если доживёшь до вечера — не жди утра. Если доживёшь до утра — не жди вечера. Используй здоровье до болезни и жизнь до смерти». [Бухари]"
    },
    {
      "hadithnumber": 42,
      "arabicnumber": 42,
      "text": "Передаёт Анас (да будет доволен им Аллах): Я слышал, как Пророк (мир ему) сказал: «Аллах сказал: 'О сын Адама, пока ты будешь звать Меня и надеяться на Меня — Я прощу тебе, даже если твои грехи достигнут облаков…'» (хадис кудси о прощении и милости). [Тирмизи]"
    }
  ]
}
